programming/python/notes/skeleton.org
#+title: my python index
#+OPTIONS: ^:nil num:nil author:nil email:nil creator:nil timestamp:nil

* simple data types

** int

#+BEGIN_SRC text -n :tangle int.txt :padline no
class int in module __builtin__:
<type 'int'>
help('int')

postive and negative numbers
#+END_SRC

** float

#+BEGIN_SRC text -n :tangle float.txt :padline no
real numbers

class float in module __builtin__:
help('float')
<type 'float'>
#+END_SRC

** bool

#+BEGIN_SRC text -n :angle xxx.txt :padline no
  class bool in module __builtin__:
  - booleans
  <type 'bool'>
  help('bool')
#+END_SRC

** str

#+BEGIN_SRC text -n :tangle str.txt :padline no
  class str in module __builtin__:
  <type 'str'>
  help('str')

  - http://docs.python.org/library/string.html

  - methods
        - upper()
        - lower()
        - replace() ; Replace(old,new) print banner.replace('FreeFloat','Ability')
        - find() ; offset where the first occurrence of the substring occurs

  - interpolation/ concatenation
  print "[+] Checking for "+banner+" on port "+str(port)
  print "[+] There are "+str(pos)+" ports to scan before 80."
  "+str(services['ftp'])

  STRING FORMATTING

  https://realpython.com/python-string-formatting/ ; good overview

  NEW STYLE STRING FORMATTING

  https://docs.python.org/3/library/string.html#string-formatting

  PRINTF-STYLE STRING FORMATTING

  https://docs.python.org/3/library/stdtypes.html#old-string-formatting

  %% to escape %
  \ ; new line?
  %x hex
  %r ; string version of objects

  substitions
  - create a dictionary with substitutions
    - dctSub = {'foo':'bar'}
  - create here string with placeholders
    - %(foo)s
  - print (hereString % dctSub)

  gotchas
  - variables are case senstive
  - must be a match for every substitution
  - by default doesn't ignore errors

  %s %s %s % (a,b,c) ; why use this format? in loops?
#+END_SRC

* complex data types

** tuple

#+BEGIN_SRC text -n :tangle lists.txt :padline no
  >>> p = (4, 5)
  >>> type(p)
  <type 'tuple'>

  - immutable. can't ever change
  - round brackets parentheses and commas (,)

  - can access the variables in a tuple by index

  >>> tupA = os.path.split(cc1)
  >>> tupA
  ('/home/janowah', '.emacs')
  >>> tupA[1]
  '.emacs'
  >>> tupA[0]
  '/home/janowah'
  >>> varA = tupA[1]
  >>> varA
  '.emacs'
#+END_SRC

