programming/python/notes/skeleton.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>my python index</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">my python index</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8b68838">simple data types</a>
<ul>
<li><a href="#org3c13b1a">int</a></li>
<li><a href="#orgc815d61">float</a></li>
<li><a href="#orgd9ec7b5">bool</a></li>
<li><a href="#org5aa1475">str</a></li>
</ul>
</li>
<li><a href="#org20817fb">complex data types</a>
<ul>
<li><a href="#org6d75e5d">tuple</a></li>
<li><a href="#orgb385a92">list</a></li>
<li><a href="#org70a4c47">dict</a></li>
<li><a href="#orgb42315e">set</a></li>
</ul>
</li>
<li><a href="#org192b231">flow control</a>
<ul>
<li><a href="#orgf74c986">if</a></li>
<li><a href="#orge4c602b">if else</a></li>
<li><a href="#org3b531f4">if elif else</a></li>
<li><a href="#org59c8bc8">try except</a></li>
<li><a href="#org5742245">not</a></li>
<li><a href="#org423fc66">foreach (enumerate)</a></li>
</ul>
</li>
<li><a href="#org4db474e">looping</a>
<ul>
<li><a href="#orga0a59f9">for</a></li>
<li><a href="#orgb58b955">while</a></li>
</ul>
</li>
<li><a href="#org23f0675">functions</a></li>
<li><a href="#orgab20f72">built-in functions</a>
<ul>
<li><a href="#orgfeba696">open</a></li>
</ul>
</li>
<li><a href="#org4f7f27f">modules (built-in)</a>
<ul>
<li><a href="#org8b82855">socket ; networking</a></li>
<li><a href="#orge469b2e">sys</a></li>
<li><a href="#org65717f9">os</a></li>
<li><a href="#orgce54a73">crypt</a></li>
<li><a href="#orgf1a3717">zipfile</a></li>
<li><a href="#orga8e1879">threading</a></li>
<li><a href="#org845a0f3">optparse</a></li>
<li><a href="#org6952889">shelve</a></li>
<li><a href="#org2563434">glob</a></li>
<li><a href="#orgae00ea7">date time</a></li>
<li><a href="#org9f7ee0b">ftplib</a></li>
<li><a href="#org9b7dae3">pprint</a></li>
<li><a href="#org75c8290">json</a></li>
<li><a href="#org6384041">sqlite</a></li>
<li><a href="#org2e5f680">pyperclip</a></li>
<li><a href="#org96380aa">re</a></li>
</ul>
</li>
<li><a href="#orgdef96a4">i/o</a></li>
<li><a href="#org900eaad">casting</a></li>
<li><a href="#orgf5f96e1">emacs setup</a></li>
<li><a href="#org693a0ae">debugging</a></li>
<li><a href="#orgcc775da">python shell</a></li>
<li><a href="#org01d4a07">classes</a></li>
<li><a href="#org49914e1">help</a></li>
<li><a href="#orgbe8218d">escapes</a></li>
<li><a href="#org28c567e">find out</a></li>
<li><a href="#orga031677">comparison operators</a></li>
<li><a href="#org0504186">3rd party modules</a>
<ul>
<li><a href="#org8619789">installing</a></li>
<li><a href="#orga428c1d">examples</a></li>
</ul>
</li>
<li><a href="#org3f9922c">differences between python2 and python3</a></li>
<li><a href="#orgea4a39f">web libraries</a></li>
<li><a href="#orgcf25472">idle3</a></li>
<li><a href="#orgd7cb166">how to</a>
<ul>
<li><a href="#orgf7a24ab">read function from file in shell</a></li>
</ul>
</li>
<li><a href="#orgbf0df5b">docstrings</a></li>
<li><a href="#orgfab5d28">modules</a></li>
<li><a href="#org0bb587a">notes on this document</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8b68838" class="outline-2">
<h2 id="org8b68838">simple data types</h2>
<div class="outline-text-2" id="text-org8b68838">
</div>
<div id="outline-container-org3c13b1a" class="outline-3">
<h3 id="org3c13b1a">int</h3>
<div class="outline-text-3" id="text-org3c13b1a">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>class int in module __builtin__:
<span class="linenr">2: </span>&lt;type 'int'&gt;
<span class="linenr">3: </span>help('int')
<span class="linenr">4: </span>
<span class="linenr">5: </span>postive and negative numbers
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc815d61" class="outline-3">
<h3 id="orgc815d61">float</h3>
<div class="outline-text-3" id="text-orgc815d61">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>real numbers
<span class="linenr">2: </span>
<span class="linenr">3: </span>class float in module __builtin__:
<span class="linenr">4: </span>help('float')
<span class="linenr">5: </span>&lt;type 'float'&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9ec7b5" class="outline-3">
<h3 id="orgd9ec7b5">bool</h3>
<div class="outline-text-3" id="text-orgd9ec7b5">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>class bool in module __builtin__:
<span class="linenr">2: </span>- booleans
<span class="linenr">3: </span>&lt;type 'bool'&gt;
<span class="linenr">4: </span>help('bool')
</pre>
</div>
</div>
</div>

<div id="outline-container-org5aa1475" class="outline-3">
<h3 id="org5aa1475">str</h3>
<div class="outline-text-3" id="text-org5aa1475">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>class str in module __builtin__:
<span class="linenr"> 2: </span>&lt;type 'str'&gt;
<span class="linenr"> 3: </span>help('str')
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>- http://docs.python.org/library/string.html
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>- methods
<span class="linenr"> 8: </span>      - upper()
<span class="linenr"> 9: </span>      - lower()
<span class="linenr">10: </span>      - replace() ; Replace(old,new) print banner.replace('FreeFloat','Ability')
<span class="linenr">11: </span>      - find() ; offset where the first occurrence of the substring occurs
<span class="linenr">12: </span>
<span class="linenr">13: </span>- interpolation/ concatenation
<span class="linenr">14: </span>print "[+] Checking for "+banner+" on port "+str(port)
<span class="linenr">15: </span>print "[+] There are "+str(pos)+" ports to scan before 80."
<span class="linenr">16: </span>"+str(services['ftp'])
<span class="linenr">17: </span>
<span class="linenr">18: </span>STRING FORMATTING
<span class="linenr">19: </span>
<span class="linenr">20: </span>https://realpython.com/python-string-formatting/ ; good overview
<span class="linenr">21: </span>
<span class="linenr">22: </span>NEW STYLE STRING FORMATTING
<span class="linenr">23: </span>
<span class="linenr">24: </span>https://docs.python.org/3/library/string.html#string-formatting
<span class="linenr">25: </span>
<span class="linenr">26: </span>PRINTF-STYLE STRING FORMATTING
<span class="linenr">27: </span>
<span class="linenr">28: </span>https://docs.python.org/3/library/stdtypes.html#old-string-formatting
<span class="linenr">29: </span>
<span class="linenr">30: </span>%% to escape %
<span class="linenr">31: </span>\ ; new line?
<span class="linenr">32: </span>%x hex
<span class="linenr">33: </span>%r ; string version of objects
<span class="linenr">34: </span>
<span class="linenr">35: </span>substitions
<span class="linenr">36: </span>- create a dictionary with substitutions
<span class="linenr">37: </span>  - dctSub = {'foo':'bar'}
<span class="linenr">38: </span>- create here string with placeholders
<span class="linenr">39: </span>  - %(foo)s
<span class="linenr">40: </span>- print (hereString % dctSub)
<span class="linenr">41: </span>
<span class="linenr">42: </span>gotchas
<span class="linenr">43: </span>- variables are case senstive
<span class="linenr">44: </span>- must be a match for every substitution
<span class="linenr">45: </span>- by default doesn't ignore errors
<span class="linenr">46: </span>
<span class="linenr">47: </span>%s %s %s % (a,b,c) ; why use this format? in loops?
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org20817fb" class="outline-2">
<h2 id="org20817fb">complex data types</h2>
<div class="outline-text-2" id="text-org20817fb">
</div>
<div id="outline-container-org6d75e5d" class="outline-3">
<h3 id="org6d75e5d">tuple</h3>
<div class="outline-text-3" id="text-org6d75e5d">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>&gt;&gt;&gt; p = (4, 5)
<span class="linenr"> 2: </span>&gt;&gt;&gt; type(p)
<span class="linenr"> 3: </span>&lt;type 'tuple'&gt;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>- immutable. can't ever change
<span class="linenr"> 6: </span>- round brackets parentheses and commas (,)
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>- can access the variables in a tuple by index
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>&gt;&gt;&gt; tupA = os.path.split(cc1)
<span class="linenr">11: </span>&gt;&gt;&gt; tupA
<span class="linenr">12: </span>('/home/janowah', '.emacs')
<span class="linenr">13: </span>&gt;&gt;&gt; tupA[1]
<span class="linenr">14: </span>'.emacs'
<span class="linenr">15: </span>&gt;&gt;&gt; tupA[0]
<span class="linenr">16: </span>'/home/janowah'
<span class="linenr">17: </span>&gt;&gt;&gt; varA = tupA[1]
<span class="linenr">18: </span>&gt;&gt;&gt; varA
<span class="linenr">19: </span>'.emacs'
</pre>
</div>
</div>
</div>
