programming/python/notes/skeleton.org
** foreach (enumerate)

#+BEGIN_SRC text -n :angle xxx.txt :padline no
my_list = [1,2,3]
for member in my_list:
    member = 42
print my_list

Output:

    [1, 2, 3]

If you want to change a list containing immutable types, you need to do something like:

my_list = [1,2,3]
for ndx, member in enumerate(my_list):
    my_list[ndx] += 42
print my_list

Output:

    [43, 44, 45]

#+END_SRC

* looping

Related help topics: break, continue, while

** for

#+BEGIN_SRC text -n :tangle for.txt :padline no
The ``for`` statement
help('for')

>>> for x in range(1,255):
  ...     print "192.168.95."+str(x)

<list>
for port in portList:
  ...     print port

nested
for x in range(1,255):
  ...     for port in portList:
  ...             print "[+] Checking 192.168.95."\
  ...             +str(x)+": "+str(port)

for i in reversed(array):
...     print(i)
#+END_SRC


** while

#+BEGIN_SRC text -n :angle xxx.txt :padline no

#+END_SRC

* functions

#+BEGIN_SRC text -n :tangle functions.txt :padline no
  help('def')

  Function definitions
  ,********************

  A function definition defines a user-defined function object 

  naming
  functions.  can't use _ or -


  def retBanner(ip, port):

   def main():
  if __name__ == '__main__':
            main()

  MAIN
  good article on main()
  https://www.journaldev.com/17752/python-main-function
#+END_SRC

* built-in functions

** open

#+BEGIN_SRC text -n :angle xxx.txt :padline no

help('open')

- what type of object is the file handle? fileObj?
  - methods
    - .read()
    - .readlines()
    - .write() 
    - .close()
  - modes
    - w open for writing
    - a append
    - r read only?

>>> test2.name
'python.org'
>>> test2.mode
'r'
>>> test2.newlines
>>> test2.encoding
'UTF-8'
#+END_SRC

* modules (built-in)

all require and import statment

** socket ; networking

#+BEGIN_SRC text -n :angle socket.txt :padline no
>>> help('socket')
Help on module socket:

http://docs.Python.org/library/socket.html.

>>> import socket
  >>> socket.setdefaulttimeout(2)
  >>> s = socket.socket()
  >>> s.connect(("ftp.ncftp.com",21))
  >>> ans = s.recv(1024)
  >>> print ans
  220 ProFTPD Server (ncftpd.com's FTP Server) [209.197.102.38]

socket.gethostbyname(hostname) – This function takes a hostname such
as www.syngress.com and returns an IPv4 address format such as
69.163.177.2.
socket.gethostbyaddr(ip address) – This function takes an IPv4 address
and returns a triple containing the hostname, alternative list of
host names, and a list of IPv4/v6 addresses for the same interface
on the host.
socket.socket([family[, type[, proto]]]) – This function creates an
instance of a new socket given the family. Options for the socket
family are AF_INET, AF_INET6, or AF_UNIX. Additionally, the socket
can be specified as SOCK_STREAM for a TCP socket or SOCK_DGRAM for
a UDP socket. Finally, the protocol number is usually zero and is
omitted in most cases.
socket.create_connection(address[, timeout[, source_address]]) – This
function takes a 2-tuple (host, port) and returns an instance of a
network socket. Additi

#+END_SRC

** sys

#+BEGIN_SRC text -n :tangle sys.txt :padline no
>>> help('sys')
Help on built-in module sys:


The built-in sys module provides access to objects used or maintained
by the Python interpreter. This includes flags, version, max sizes of
integers, available modules, path hooks, location of standard
error/in/out, and command line arguments called by the
interpreter.

http://docs.python.org/library/sys.

help('sys')

;; read command line arguments
import sys
  if len(sys.argv)==2:
      filename = sys.argv[1]
      print "[+] Reading Vulnerabilities From: "+filename

sys.argv[1]
#+END_SRC

