programming/python/notes/skeleton.html

<div id="outline-container-org5742245" class="outline-3">
<h3 id="org5742245">not</h3>
<div class="outline-text-3" id="text-org5742245">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>if not (True):
<span class="linenr"> 2: </span>...    print('a')
<span class="linenr"> 3: </span>... else:
<span class="linenr"> 4: </span>...    print('b')
<span class="linenr"> 5: </span>... 
<span class="linenr"> 6: </span>b
<span class="linenr"> 7: </span>&gt;&gt;&gt; if (True):
<span class="linenr"> 8: </span>...    print('a')
<span class="linenr"> 9: </span>... else:
<span class="linenr">10: </span>...    print('b')
<span class="linenr">11: </span>... 
</pre>
</div>
</div>
</div>

<div id="outline-container-org423fc66" class="outline-3">
<h3 id="org423fc66">foreach (enumerate)</h3>
<div class="outline-text-3" id="text-org423fc66">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>my_list = [1,2,3]
<span class="linenr"> 2: </span>for member in my_list:
<span class="linenr"> 3: </span>    member = 42
<span class="linenr"> 4: </span>print my_list
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>Output:
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    [1, 2, 3]
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>If you want to change a list containing immutable types, you need to do something like:
<span class="linenr">11: </span>
<span class="linenr">12: </span>my_list = [1,2,3]
<span class="linenr">13: </span>for ndx, member in enumerate(my_list):
<span class="linenr">14: </span>    my_list[ndx] += 42
<span class="linenr">15: </span>print my_list
<span class="linenr">16: </span>
<span class="linenr">17: </span>Output:
<span class="linenr">18: </span>
<span class="linenr">19: </span>    [43, 44, 45]
<span class="linenr">20: </span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4db474e" class="outline-2">
<h2 id="org4db474e">looping</h2>
<div class="outline-text-2" id="text-org4db474e">
<p>
Related help topics: break, continue, while
</p>
</div>

<div id="outline-container-orga0a59f9" class="outline-3">
<h3 id="orga0a59f9">for</h3>
<div class="outline-text-3" id="text-orga0a59f9">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>The ``for`` statement
<span class="linenr"> 2: </span>help('for')
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>&gt;&gt;&gt; for x in range(1,255):
<span class="linenr"> 5: </span>  ...     print "192.168.95."+str(x)
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>&lt;list&gt;
<span class="linenr"> 8: </span>for port in portList:
<span class="linenr"> 9: </span>  ...     print port
<span class="linenr">10: </span>
<span class="linenr">11: </span>nested
<span class="linenr">12: </span>for x in range(1,255):
<span class="linenr">13: </span>  ...     for port in portList:
<span class="linenr">14: </span>  ...             print "[+] Checking 192.168.95."\
<span class="linenr">15: </span>  ...             +str(x)+": "+str(port)
<span class="linenr">16: </span>
<span class="linenr">17: </span>for i in reversed(array):
<span class="linenr">18: </span>...     print(i)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb58b955" class="outline-3">
<h3 id="orgb58b955">while</h3>
<div class="outline-text-3" id="text-orgb58b955">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org23f0675" class="outline-2">
<h2 id="org23f0675">functions</h2>
<div class="outline-text-2" id="text-org23f0675">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>help('def')
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>Function definitions
<span class="linenr"> 4: </span>********************
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>A function definition defines a user-defined function object 
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>naming
<span class="linenr"> 9: </span>functions.  can't use _ or -
<span class="linenr">10: </span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>def retBanner(ip, port):
<span class="linenr">13: </span>
<span class="linenr">14: </span> def main():
<span class="linenr">15: </span>if __name__ == '__main__':
<span class="linenr">16: </span>          main()
<span class="linenr">17: </span>
<span class="linenr">18: </span>MAIN
<span class="linenr">19: </span>good article on main()
<span class="linenr">20: </span>https://www.journaldev.com/17752/python-main-function
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab20f72" class="outline-2">
<h2 id="orgab20f72">built-in functions</h2>
<div class="outline-text-2" id="text-orgab20f72">
</div>
<div id="outline-container-orgfeba696" class="outline-3">
<h3 id="orgfeba696">open</h3>
<div class="outline-text-3" id="text-orgfeba696">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span>help('open')
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>- what type of object is the file handle? fileObj?
<span class="linenr"> 5: </span>  - methods
<span class="linenr"> 6: </span>    - .read()
<span class="linenr"> 7: </span>    - .readlines()
<span class="linenr"> 8: </span>    - .write() 
<span class="linenr"> 9: </span>    - .close()
<span class="linenr">10: </span>  - modes
<span class="linenr">11: </span>    - w open for writing
<span class="linenr">12: </span>    - a append
<span class="linenr">13: </span>    - r read only?
<span class="linenr">14: </span>
<span class="linenr">15: </span>&gt;&gt;&gt; test2.name
<span class="linenr">16: </span>'python.org'
<span class="linenr">17: </span>&gt;&gt;&gt; test2.mode
<span class="linenr">18: </span>'r'
<span class="linenr">19: </span>&gt;&gt;&gt; test2.newlines
<span class="linenr">20: </span>&gt;&gt;&gt; test2.encoding
<span class="linenr">21: </span>'UTF-8'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4f7f27f" class="outline-2">
<h2 id="org4f7f27f">modules (built-in)</h2>
<div class="outline-text-2" id="text-org4f7f27f">
<p>
all require and import statment
</p>
</div>

<div id="outline-container-org8b82855" class="outline-3">
<h3 id="org8b82855">socket ; networking</h3>
<div class="outline-text-3" id="text-org8b82855">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>&gt;&gt;&gt; help('socket')
<span class="linenr"> 2: </span>Help on module socket:
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>http://docs.Python.org/library/socket.html.
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>&gt;&gt;&gt; import socket
<span class="linenr"> 7: </span>  &gt;&gt;&gt; socket.setdefaulttimeout(2)
<span class="linenr"> 8: </span>  &gt;&gt;&gt; s = socket.socket()
<span class="linenr"> 9: </span>  &gt;&gt;&gt; s.connect(("ftp.ncftp.com",21))
<span class="linenr">10: </span>  &gt;&gt;&gt; ans = s.recv(1024)
<span class="linenr">11: </span>  &gt;&gt;&gt; print ans
<span class="linenr">12: </span>  220 ProFTPD Server (ncftpd.com's FTP Server) [209.197.102.38]
<span class="linenr">13: </span>
<span class="linenr">14: </span>socket.gethostbyname(hostname) &#8211; This function takes a hostname such
<span class="linenr">15: </span>as www.syngress.com and returns an IPv4 address format such as
<span class="linenr">16: </span>69.163.177.2.
<span class="linenr">17: </span>socket.gethostbyaddr(ip address) &#8211; This function takes an IPv4 address
<span class="linenr">18: </span>and returns a triple containing the hostname, alternative list of
<span class="linenr">19: </span>host names, and a list of IPv4/v6 addresses for the same interface
<span class="linenr">20: </span>on the host.
<span class="linenr">21: </span>socket.socket([family[, type[, proto]]]) &#8211; This function creates an
<span class="linenr">22: </span>instance of a new socket given the family. Options for the socket
<span class="linenr">23: </span>family are AF_INET, AF_INET6, or AF_UNIX. Additionally, the socket
<span class="linenr">24: </span>can be specified as SOCK_STREAM for a TCP socket or SOCK_DGRAM for
<span class="linenr">25: </span>a UDP socket. Finally, the protocol number is usually zero and is
<span class="linenr">26: </span>omitted in most cases.
<span class="linenr">27: </span>socket.create_connection(address[, timeout[, source_address]]) &#8211; This
<span class="linenr">28: </span>function takes a 2-tuple (host, port) and returns an instance of a
<span class="linenr">29: </span>network socket. Additi
<span class="linenr">30: </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge469b2e" class="outline-3">
<h3 id="orge469b2e">sys</h3>
<div class="outline-text-3" id="text-orge469b2e">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>&gt;&gt;&gt; help('sys')
<span class="linenr"> 2: </span>Help on built-in module sys:
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>The built-in sys module provides access to objects used or maintained
<span class="linenr"> 6: </span>by the Python interpreter. This includes flags, version, max sizes of
<span class="linenr"> 7: </span>integers, available modules, path hooks, location of standard
<span class="linenr"> 8: </span>error/in/out, and command line arguments called by the
<span class="linenr"> 9: </span>interpreter.
<span class="linenr">10: </span>
<span class="linenr">11: </span>http://docs.python.org/library/sys.
<span class="linenr">12: </span>
<span class="linenr">13: </span>help('sys')
<span class="linenr">14: </span>
<span class="linenr">15: </span>;; read command line arguments
<span class="linenr">16: </span>import sys
<span class="linenr">17: </span>  if len(sys.argv)==2:
<span class="linenr">18: </span>      filename = sys.argv[1]
<span class="linenr">19: </span>      print "[+] Reading Vulnerabilities From: "+filename
<span class="linenr">20: </span>
<span class="linenr">21: </span>sys.argv[1]
</pre>
</div>
</div>
</div>
