programming/python/notes/skeleton.org
** date time

#+BEGIN_SRC text -n :tangle datetime.txt :padline no
>>> help('datetime')
Help on module datetime:

NAME
    datetime - Fast implementation of the datetime type.

from datetime import datetime

>>> os.path.getmtime('python.org') ; modified time
1543435561.1202424
>>> os.path.getctime('python.org') ; created time. no use in *nix
1543435561.1202424

>>> print(datetime.utcfromtimestamp(1543435561.1202424).strftime('%Y-%m-%d %H:%M:%S'))        
2018-11-28 20:06:01
>>> print(datetime.utcfromtimestamp(1543435561.1202424).strftime('%Y-%m-%d %H:%M'))
2018-11-28 20:06
>>> 
#+END_SRC

** ftplib

#+BEGIN_SRC text -n :tangle datetime.txt :padline no

#+END_SRC

** pprint

#+BEGIN_SRC text -n :tangle pprint.txt :padline no
  >>> help('pprint')
  Help on module pprint:

  NAME
      pprint - Support to pretty-print lists, tuples, & dictionaries recursively.

  import pprint
  pp = pprint.PrettyPrinter(indent=4)
  pp.pprint(objects)

  pp.pprint(objects['responseData']['results'])
#+END_SRC

** json

#+BEGIN_SRC text -n :tangle json.txt :padline no
  >>> help('json')
  Help on package json:

  json.load()  ; takes a file like object with a read() method,
  json.loads() ; takes a string ; returns a dict
#+END_SRC

** sqlite

#+BEGIN_SRC python

Help on package sqlite3:

NAME
    sqlite3

FILE
    /usr/lib64/python2.7/sqlite3/__init__.py

https://docs.python.org/2/library/sqlite3.html

import sqlite3

def printProfile(skypeDB):
    conn = sqlite3.connect(skypeDB)
    c = conn.cursor()
    c.execute("SELECT fullname, skypename, city, country, \
datetime(profile_timestamp,'unixepoch') FROM Accounts;")
    for row in c:
        print '[*] -- Found Account --'
        print '[+] User           : '+str(row[0])
        print '[+] Skype Username : '+str(row[1])
        print '[+] Location       : '+str(row[2])+','+str(row[3])
        print '[+] Profile Date   : '+str(row[4])

def printContacts(skypeDB):

>>> for row in c.execute('SELECT tbl_name FROM sqlite_master WHERE type=="table"'):
	print(row)
#+END_SRC

** pyperclip

#+BEGIN_SRC text
  Help on package pyperclip:

  NAME
      pyperclip - Pyperclip

  DESCRIPTION
      A cross-platform clipboard module for Python. (only handles plain text for now)
      By Al Sweigart al@inventwithpython.com
      BSD License
#+END_SRC    

** re

#+BEGIN_SRC text
  Help on module re:

  NAME
      re - Support for regular expressions (RE).
#+END_SRC

* i/o

#+BEGIN_SRC text -n :angle xxx.txt :padline no

read write from file & screen
redirect stdin, stdout and stderr

print(portlist) 
print portlist

read from file
 >>> def checkVulns(banner):
  ...     f = open("vuln_banners.txt",'r')
  ...     for line in f.readlines():
  ...             if line.strip('\n') in banner:
  ...                     print "[+] Server is vulnerable: "+banner.strip('\n')
  ... 

#+END_SRC

* casting

#+BEGIN_SRC text -n :angle xxx.txt :padline no
#+END_SRC

* emacs setup

#+BEGIN_SRC text -n :angle xxx.txt :padline no
  - python.el ; built-in
    - inferior shell
    - skeletons
    - debugging with pdb
    - editing
  - yasnippet

  other modes
  - python-mode
  - elpy

  - other shells
  - ipython
  - pypy is default. CHECK

  ;; to switch to python3

  (setq python-shell-interpreter "python3")
  "python3"

  (setq python-shell-completion-native-disabled-interpreters '("python3"))
  ("python3")


  ;; 
  - how to set emacs to 4 spaces per tab?

      (add-hook 'python-mode-hook
              (lambda ()
                      (setq-default indent-tabs-mode t)
                      (setq-default tab-width 4)
                      (setq-default py-indent-tabs-mode t)
                      (add-to-list 'write-file-functions 'delete-trailing-whitespace)))

  ;; 
  (add-hook 'python-mode-hook
                    (lambda ()
                          (setq-default tab-width 4)))


  (setq tab-width 4)
  4
  (custom-set-variables
   '(python-guess-indent nil)
   '(python-indent-offset 2))
#+END_SRC

* debugging

#+BEGIN_SRC text -n :angle xxx.txt :padline no

pdb

python3 -m pdb hello.py
#+END_SRC

* python shell

#+BEGIN_SRC text -n :tangle shell.txt :padline no
  - how to run a script from the python shell?
  - clear the screen?
  - print current version
  - dir() will give you the <list> of in scope variables
    - >>> help('dir')
    - Help on built-in function dir in module __builtin__:
    - If called without an argument, return the names in the current scope.
  - With python 3 interpreter the history is written to
    ~/.python_history

  clear variable
  dir() ; list
  del ; delete
#+END_SRC

