programming/python/notes/skeleton.html

<div id="outline-container-orgae00ea7" class="outline-3">
<h3 id="orgae00ea7">date time</h3>
<div class="outline-text-3" id="text-orgae00ea7">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>&gt;&gt;&gt; help('datetime')
<span class="linenr"> 2: </span>Help on module datetime:
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>NAME
<span class="linenr"> 5: </span>    datetime - Fast implementation of the datetime type.
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>from datetime import datetime
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>&gt;&gt;&gt; os.path.getmtime('python.org') ; modified time
<span class="linenr">10: </span>1543435561.1202424
<span class="linenr">11: </span>&gt;&gt;&gt; os.path.getctime('python.org') ; created time. no use in *nix
<span class="linenr">12: </span>1543435561.1202424
<span class="linenr">13: </span>
<span class="linenr">14: </span>&gt;&gt;&gt; print(datetime.utcfromtimestamp(1543435561.1202424).strftime('%Y-%m-%d %H:%M:%S'))        
<span class="linenr">15: </span>2018-11-28 20:06:01
<span class="linenr">16: </span>&gt;&gt;&gt; print(datetime.utcfromtimestamp(1543435561.1202424).strftime('%Y-%m-%d %H:%M'))
<span class="linenr">17: </span>2018-11-28 20:06
<span class="linenr">18: </span>&gt;&gt;&gt; 
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f7ee0b" class="outline-3">
<h3 id="org9f7ee0b">ftplib</h3>
<div class="outline-text-3" id="text-org9f7ee0b">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b7dae3" class="outline-3">
<h3 id="org9b7dae3">pprint</h3>
<div class="outline-text-3" id="text-org9b7dae3">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>&gt;&gt;&gt; help('pprint')
<span class="linenr"> 2: </span>Help on module pprint:
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>NAME
<span class="linenr"> 5: </span>    pprint - Support to pretty-print lists, tuples, &amp; dictionaries recursively.
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>import pprint
<span class="linenr"> 8: </span>pp = pprint.PrettyPrinter(indent=4)
<span class="linenr"> 9: </span>pp.pprint(objects)
<span class="linenr">10: </span>
<span class="linenr">11: </span>pp.pprint(objects['responseData']['results'])
</pre>
</div>
</div>
</div>

<div id="outline-container-org75c8290" class="outline-3">
<h3 id="org75c8290">json</h3>
<div class="outline-text-3" id="text-org75c8290">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>&gt;&gt;&gt; help('json')
<span class="linenr">2: </span>Help on package json:
<span class="linenr">3: </span>
<span class="linenr">4: </span>json.load()  ; takes a file like object with a read() method,
<span class="linenr">5: </span>json.loads() ; takes a string ; returns a dict
</pre>
</div>
</div>
</div>

<div id="outline-container-org6384041" class="outline-3">
<h3 id="org6384041">sqlite</h3>
<div class="outline-text-3" id="text-org6384041">
<div class="org-src-container">
<pre class="src src-python">
Help on package sqlite3:

NAME
    sqlite3

FILE
    /usr/lib64/python2.7/sqlite3/__init__.py

https://docs.python.org/2/library/sqlite3.html

<span style="color: #00ffff;">import</span> sqlite3

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">printProfile</span>(skypeDB):
    <span style="color: #eedd82;">conn</span> = sqlite3.connect(skypeDB)
    <span style="color: #eedd82;">c</span> = conn.cursor()
    c.execute(<span style="color: #ffa07a;">"SELECT fullname, skypename, city, country, \</span>
<span style="color: #ffa07a;">datetime(profile_timestamp,'unixepoch') FROM Accounts;"</span>)
    <span style="color: #00ffff;">for</span> row <span style="color: #00ffff;">in</span> c:
        <span style="color: #00ffff;">print</span> <span style="color: #ffa07a;">'[*] -- Found Account --'</span>
        <span style="color: #00ffff;">print</span> <span style="color: #ffa07a;">'[+] User           : '</span>+<span style="color: #b0c4de;">str</span>(row[0])
        <span style="color: #00ffff;">print</span> <span style="color: #ffa07a;">'[+] Skype Username : '</span>+<span style="color: #b0c4de;">str</span>(row[1])
        <span style="color: #00ffff;">print</span> <span style="color: #ffa07a;">'[+] Location       : '</span>+<span style="color: #b0c4de;">str</span>(row[2])+<span style="color: #ffa07a;">','</span>+<span style="color: #b0c4de;">str</span>(row[3])
        <span style="color: #00ffff;">print</span> <span style="color: #ffa07a;">'[+] Profile Date   : '</span>+<span style="color: #b0c4de;">str</span>(row[4])

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">printContacts</span>(skypeDB):

&gt;&gt;&gt; <span style="color: #00ffff;">for</span> row <span style="color: #00ffff;">in</span> c.execute(<span style="color: #ffa07a;">'SELECT tbl_name FROM sqlite_master WHERE type=="table"'</span>):
        <span style="color: #00ffff;">print</span>(row)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e5f680" class="outline-3">
<h3 id="org2e5f680">pyperclip</h3>
<div class="outline-text-3" id="text-org2e5f680">
<div class="org-src-container">
<pre class="src src-text">Help on package pyperclip:

NAME
    pyperclip - Pyperclip

DESCRIPTION
    A cross-platform clipboard module for Python. (only handles plain text for now)
    By Al Sweigart al@inventwithpython.com
    BSD License
</pre>
</div>
</div>
</div>

<div id="outline-container-org96380aa" class="outline-3">
<h3 id="org96380aa">re</h3>
<div class="outline-text-3" id="text-org96380aa">
<div class="org-src-container">
<pre class="src src-text">Help on module re:

NAME
    re - Support for regular expressions (RE).
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdef96a4" class="outline-2">
<h2 id="orgdef96a4">i/o</h2>
<div class="outline-text-2" id="text-orgdef96a4">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span>read write from file &amp; screen
<span class="linenr"> 3: </span>redirect stdin, stdout and stderr
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>print(portlist) 
<span class="linenr"> 6: </span>print portlist
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>read from file
<span class="linenr"> 9: </span> &gt;&gt;&gt; def checkVulns(banner):
<span class="linenr">10: </span>  ...     f = open("vuln_banners.txt",'r')
<span class="linenr">11: </span>  ...     for line in f.readlines():
<span class="linenr">12: </span>  ...             if line.strip('\n') in banner:
<span class="linenr">13: </span>  ...                     print "[+] Server is vulnerable: "+banner.strip('\n')
<span class="linenr">14: </span>  ... 
<span class="linenr">15: </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org900eaad" class="outline-2">
<h2 id="org900eaad">casting</h2>
<div class="outline-text-2" id="text-org900eaad">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf5f96e1" class="outline-2">
<h2 id="orgf5f96e1">emacs setup</h2>
<div class="outline-text-2" id="text-orgf5f96e1">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>- python.el ; built-in
<span class="linenr"> 2: </span>  - inferior shell
<span class="linenr"> 3: </span>  - skeletons
<span class="linenr"> 4: </span>  - debugging with pdb
<span class="linenr"> 5: </span>  - editing
<span class="linenr"> 6: </span>- yasnippet
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>other modes
<span class="linenr"> 9: </span>- python-mode
<span class="linenr">10: </span>- elpy
<span class="linenr">11: </span>
<span class="linenr">12: </span>- other shells
<span class="linenr">13: </span>- ipython
<span class="linenr">14: </span>- pypy is default. CHECK
<span class="linenr">15: </span>
<span class="linenr">16: </span>;; to switch to python3
<span class="linenr">17: </span>
<span class="linenr">18: </span>(setq python-shell-interpreter "python3")
<span class="linenr">19: </span>"python3"
<span class="linenr">20: </span>
<span class="linenr">21: </span>(setq python-shell-completion-native-disabled-interpreters '("python3"))
<span class="linenr">22: </span>("python3")
<span class="linenr">23: </span>
<span class="linenr">24: </span>
<span class="linenr">25: </span>;; 
<span class="linenr">26: </span>- how to set emacs to 4 spaces per tab?
<span class="linenr">27: </span>
<span class="linenr">28: </span>    (add-hook 'python-mode-hook
<span class="linenr">29: </span>            (lambda ()
<span class="linenr">30: </span>                    (setq-default indent-tabs-mode t)
<span class="linenr">31: </span>                    (setq-default tab-width 4)
<span class="linenr">32: </span>                    (setq-default py-indent-tabs-mode t)
<span class="linenr">33: </span>                    (add-to-list 'write-file-functions 'delete-trailing-whitespace)))
<span class="linenr">34: </span>
<span class="linenr">35: </span>;; 
<span class="linenr">36: </span>(add-hook 'python-mode-hook
<span class="linenr">37: </span>                  (lambda ()
<span class="linenr">38: </span>                        (setq-default tab-width 4)))
<span class="linenr">39: </span>
<span class="linenr">40: </span>
<span class="linenr">41: </span>(setq tab-width 4)
<span class="linenr">42: </span>4
<span class="linenr">43: </span>(custom-set-variables
<span class="linenr">44: </span> '(python-guess-indent nil)
<span class="linenr">45: </span> '(python-indent-offset 2))
</pre>
</div>
</div>
</div>

<div id="outline-container-org693a0ae" class="outline-2">
<h2 id="org693a0ae">debugging</h2>
<div class="outline-text-2" id="text-org693a0ae">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>
<span class="linenr">2: </span>pdb
<span class="linenr">3: </span>
<span class="linenr">4: </span>python3 -m pdb hello.py
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc775da" class="outline-2">
<h2 id="orgcc775da">python shell</h2>
<div class="outline-text-2" id="text-orgcc775da">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>- how to run a script from the python shell?
<span class="linenr"> 2: </span>- clear the screen?
<span class="linenr"> 3: </span>- print current version
<span class="linenr"> 4: </span>- dir() will give you the &lt;list&gt; of in scope variables
<span class="linenr"> 5: </span>  - &gt;&gt;&gt; help('dir')
<span class="linenr"> 6: </span>  - Help on built-in function dir in module __builtin__:
<span class="linenr"> 7: </span>  - If called without an argument, return the names in the current scope.
<span class="linenr"> 8: </span>- With python 3 interpreter the history is written to
<span class="linenr"> 9: </span>  ~/.python_history
<span class="linenr">10: </span>
<span class="linenr">11: </span>clear variable
<span class="linenr">12: </span>dir() ; list
<span class="linenr">13: </span>del ; delete
</pre>
</div>
</div>
</div>
