programming/python/notes/skeleton.org
* classes

#+BEGIN_SRC text -n :angle xxx.txt :padline no
  classes

  __DOUBLE UNDER__
  https://dbader.org/blog/python-dunder-methods ; good tutorial
#+END_SRC

* help

#+BEGIN_SRC text -n :tangle help.txt :padline no
  help('crypt')
  help('sys')
  help('zipfile')

print(portlist) 
print portlist
type(portlist)

2.7 library
https://docs.python.org/2/library/index.html


3.4 is installed on my machine
https://docs.python.org/3.5/library/index.html

#+END_SRC

* escapes

#+BEGIN_SRC text -n :angle xxx.txt :padline no
  '\n’
  \r
  \ ; continue to the next line
#+END_SRC

* find out

difference between ' and "
- using , creates tuples

dot source

linting and style

* comparison operators

#+BEGIN_SRC text -n :angle xxx.txt :padline no
  == equality

  not
  help('TRUTHVALUE')

  Operator Meaning
  ==       Equal to
  !=       Not equal to
  <        Less than
  >        Greater than
  <=       Less than or equal to
  >=       Greater than or equal to
#+END_SRC

* 3rd party modules

** installing

python2 -m pip install mechanize

- pip3 install pyinstaller
- pip3 install --upgrade

** examples
- violent python
  - Pexpect
    - http://pexpect.sourceforge.net
    - Pexpect has the ability to interact with programs, watch for
      expected outputs, and then respond based on expected outputs.
  - mechanize
    - http://wwwsearch.sourceforge.net/mechanize/
  - PYPDF
    - http://pybrary.net/pyPdf/
  - http://www.crummy.com/software/BeautifulSoup/

* differences between python2 and python3

must enclose print statement in () in 3

string formatting. use .format instead of %

* web libraries

- python2
  - urllib2
    - urllib2 - An extensible library for opening URLs using a variety of protocols
    - /usr/lib64/python2.7/urllib2.py
  - mechanize
    - /usr/lib/python2.7/site-packages/mechanize/__init__.py

- python3
  - urllib.request - An extensible library for opening URLs using a variety of protocols
* idle3

- how to view an object in the shell?
- inspect memory addresses?

* how to

** read function from file in shell

#+BEGIN_EXAMPLE
  >>> q = PriorityQueue()
  Traceback (most recent call last):
    File "<stdin>", line 1, in <module>
  TypeError: 'module' object is not callable
  >>> PriorityQueue
  <module 'PriorityQueue' from '/home/janowah/PriorityQueue.py'>

  >>> import PriorityQueue ; wrong

  >>> PriorityQueue ; check
  <class 'PriorityQueue.PriorityQueue'>

  doesn't work for data

  from mylib.py import myfunction
#+END_EXAMPLE

* docstrings

#+BEGIN_SRC text -n :angle xxx.txt :padline no

- action word. verb.
- select * from x

single line 
""" """

multiline
""" abc
def ghi
"""

>>> readMaster.__doc__
>>> print(readMaster.__doc__)
None
#+END_SRC

* modules

#+BEGIN_SRC text -n :angle xxx.txt :padline no

#+END_SRC

* notes on this document

#+BEGIN_SRC text -n :angle xxx.txt :padline no

ALL
  help('if')
  - simple example of usage
  - link to the online documentation

DATA

- crud for data types


FLOW

modules/ packages

#+END_SRC
