programming/python/notes/skeleton.html

<div id="outline-container-org01d4a07" class="outline-2">
<h2 id="org01d4a07">classes</h2>
<div class="outline-text-2" id="text-org01d4a07">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>classes
<span class="linenr">2: </span>
<span class="linenr">3: </span>__DOUBLE UNDER__
<span class="linenr">4: </span>https://dbader.org/blog/python-dunder-methods ; good tutorial
</pre>
</div>
</div>
</div>

<div id="outline-container-org49914e1" class="outline-2">
<h2 id="org49914e1">help</h2>
<div class="outline-text-2" id="text-org49914e1">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>  help('crypt')
<span class="linenr"> 2: </span>  help('sys')
<span class="linenr"> 3: </span>  help('zipfile')
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>print(portlist) 
<span class="linenr"> 6: </span>print portlist
<span class="linenr"> 7: </span>type(portlist)
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>2.7 library
<span class="linenr">10: </span>https://docs.python.org/2/library/index.html
<span class="linenr">11: </span>
<span class="linenr">12: </span>
<span class="linenr">13: </span>3.4 is installed on my machine
<span class="linenr">14: </span>https://docs.python.org/3.5/library/index.html
<span class="linenr">15: </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe8218d" class="outline-2">
<h2 id="orgbe8218d">escapes</h2>
<div class="outline-text-2" id="text-orgbe8218d">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>'\n&#8217;
<span class="linenr">2: </span>\r
<span class="linenr">3: </span>\ ; continue to the next line
</pre>
</div>
</div>
</div>

<div id="outline-container-org28c567e" class="outline-2">
<h2 id="org28c567e">find out</h2>
<div class="outline-text-2" id="text-org28c567e">
<p>
difference between ' and "
</p>
<ul class="org-ul">
<li>using , creates tuples</li>
</ul>

<p>
dot source
</p>

<p>
linting and style
</p>
</div>
</div>

<div id="outline-container-orga031677" class="outline-2">
<h2 id="orga031677">comparison operators</h2>
<div class="outline-text-2" id="text-orga031677">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>== equality
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>not
<span class="linenr"> 4: </span>help('TRUTHVALUE')
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>Operator Meaning
<span class="linenr"> 7: </span>==       Equal to
<span class="linenr"> 8: </span>!=       Not equal to
<span class="linenr"> 9: </span>&lt;        Less than
<span class="linenr">10: </span>&gt;        Greater than
<span class="linenr">11: </span>&lt;=       Less than or equal to
<span class="linenr">12: </span>&gt;=       Greater than or equal to
</pre>
</div>
</div>
</div>

<div id="outline-container-org0504186" class="outline-2">
<h2 id="org0504186">3rd party modules</h2>
<div class="outline-text-2" id="text-org0504186">
</div>
<div id="outline-container-org8619789" class="outline-3">
<h3 id="org8619789">installing</h3>
<div class="outline-text-3" id="text-org8619789">
<p>
python2 -m pip install mechanize
</p>

<ul class="org-ul">
<li>pip3 install pyinstaller</li>
<li>pip3 install &#x2013;upgrade</li>
</ul>
</div>
</div>

<div id="outline-container-orga428c1d" class="outline-3">
<h3 id="orga428c1d">examples</h3>
<div class="outline-text-3" id="text-orga428c1d">
<ul class="org-ul">
<li>violent python
<ul class="org-ul">
<li>Pexpect
<ul class="org-ul">
<li><a href="http://pexpect.sourceforge.net">http://pexpect.sourceforge.net</a></li>
<li>Pexpect has the ability to interact with programs, watch for
expected outputs, and then respond based on expected outputs.</li>
</ul></li>
<li>mechanize
<ul class="org-ul">
<li><a href="http://wwwsearch.sourceforge.net/mechanize/">http://wwwsearch.sourceforge.net/mechanize/</a></li>
</ul></li>
<li>PYPDF
<ul class="org-ul">
<li><a href="http://pybrary.net/pyPdf/">http://pybrary.net/pyPdf/</a></li>
</ul></li>
<li><a href="http://www.crummy.com/software/BeautifulSoup/">http://www.crummy.com/software/BeautifulSoup/</a></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3f9922c" class="outline-2">
<h2 id="org3f9922c">differences between python2 and python3</h2>
<div class="outline-text-2" id="text-org3f9922c">
<p>
must enclose print statement in () in 3
</p>

<p>
string formatting. use .format instead of %
</p>
</div>
</div>

<div id="outline-container-orgea4a39f" class="outline-2">
<h2 id="orgea4a39f">web libraries</h2>
<div class="outline-text-2" id="text-orgea4a39f">
<ul class="org-ul">
<li>python2
<ul class="org-ul">
<li>urllib2
<ul class="org-ul">
<li>urllib2 - An extensible library for opening URLs using a variety of protocols</li>
<li>/usr/lib64/python2.7/urllib2.py</li>
</ul></li>
<li>mechanize
<ul class="org-ul">
<li>/usr/lib/python2.7/site-packages/mechanize/__init__.py</li>
</ul></li>
</ul></li>

<li>python3
<ul class="org-ul">
<li>urllib.request - An extensible library for opening URLs using a variety of protocols</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgcf25472" class="outline-2">
<h2 id="orgcf25472">idle3</h2>
<div class="outline-text-2" id="text-orgcf25472">
<ul class="org-ul">
<li>how to view an object in the shell?</li>
<li>inspect memory addresses?</li>
</ul>
</div>
</div>

<div id="outline-container-orgd7cb166" class="outline-2">
<h2 id="orgd7cb166">how to</h2>
<div class="outline-text-2" id="text-orgd7cb166">
</div>
<div id="outline-container-orgf7a24ab" class="outline-3">
<h3 id="orgf7a24ab">read function from file in shell</h3>
<div class="outline-text-3" id="text-orgf7a24ab">
<pre class="example">
&gt;&gt;&gt; q = PriorityQueue()
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
TypeError: 'module' object is not callable
&gt;&gt;&gt; PriorityQueue
&lt;module 'PriorityQueue' from '/home/janowah/PriorityQueue.py'&gt;

&gt;&gt;&gt; import PriorityQueue ; wrong

&gt;&gt;&gt; PriorityQueue ; check
&lt;class 'PriorityQueue.PriorityQueue'&gt;

doesn't work for data

from mylib.py import myfunction
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf0df5b" class="outline-2">
<h2 id="orgbf0df5b">docstrings</h2>
<div class="outline-text-2" id="text-orgbf0df5b">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span>- action word. verb.
<span class="linenr"> 3: </span>- select * from x
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>single line 
<span class="linenr"> 6: </span>""" """
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>multiline
<span class="linenr"> 9: </span>""" abc
<span class="linenr">10: </span>def ghi
<span class="linenr">11: </span>"""
<span class="linenr">12: </span>
<span class="linenr">13: </span>&gt;&gt;&gt; readMaster.__doc__
<span class="linenr">14: </span>&gt;&gt;&gt; print(readMaster.__doc__)
<span class="linenr">15: </span>None
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfab5d28" class="outline-2">
<h2 id="orgfab5d28">modules</h2>
<div class="outline-text-2" id="text-orgfab5d28">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bb587a" class="outline-2">
<h2 id="org0bb587a">notes on this document</h2>
<div class="outline-text-2" id="text-org0bb587a">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span>ALL
<span class="linenr"> 3: </span>  help('if')
<span class="linenr"> 4: </span>  - simple example of usage
<span class="linenr"> 5: </span>  - link to the online documentation
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>DATA
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>- crud for data types
<span class="linenr">10: </span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>FLOW
<span class="linenr">13: </span>
<span class="linenr">14: </span>modules/ packages
<span class="linenr">15: </span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
